src/cf/InformationRegisters/ЗначенияКБК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияКБК</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидВзаиморасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЗначенияКБК/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Начальное заполнение регистра.
//
Процедура ЗагрузитьЗначенияКБК() Экспорт
	
	Набор = РегистрыСведений.ЗначенияКБК.СоздатьНаборЗаписей();
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительная;
	Запись.Значение = "39210202100061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительная;
	Запись.Значение = "39210202110061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "39210202100061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "39210202100061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТФОМС;
	Запись.Значение = "39210202110091000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТФОМС;
	Запись.Значение = "39210202101081012160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "39210202100081000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "39210202101081011160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ЕНВД;
	Запись.Значение = "18210502010021000110";
	
	// 2012 год
	
	// начисление зп
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники;
	Запись.Значение = "39210202020061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	Запись.Значение = "39210202010061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФСССотрудники;
	Запись.Значение = "39310202090071000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФССТравматизмСотрудники;
	Запись.Значение = "39310202050071000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.НДФЛСотрудники;
	Запись.Значение = "18210102010011000110";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФОМССотрудники;
	Запись.Значение = "39210202101081011160";
	
	// 2013 год
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительная;
	Запись.Значение = "39210202150061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "39210202140061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСвыше300ТР;
	Запись.Значение = "39210202140061000160";
	
	
	
	// 2015 год
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТорговыйСбор;
	Запись.Значение = "18210505010020000110";
	
	// 2017 год
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "18210202140061100160";
	// Было 39210202140061100160
	
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСвыше300ТР;
	Запись.Значение = "18210202140061200160";
	// Было 39210202140061200160
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСвыше300ТР;
	Запись.Значение = "18210202140061110160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "18210202140061110160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	Запись.Значение = "18210202010061000160";
	// Было 39210202010061000160
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	Запись.Значение = "18210202010061010160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФСССотрудники;
	Запись.Значение = "18210202090071000160";
	// Было 39310202090071000160
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФСССотрудники;
	Запись.Значение = "18210202090071010160";
	// Было 39310202090071000160
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФОМССотрудники;
	Запись.Значение = "18210202101081011160";
	// Было 39210202101081011160
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФОМССотрудники;
	Запись.Значение = "18210202101081013160";
	// Было 39210202101081011160
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "18210202103081011160";
	// Было 39210202103081011160
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "18210202103081013160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20170101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТорговыйСбор;
	Запись.Значение = "18210505010021000110";
	
	// 2021 год
	Запись = Набор.Добавить();
	Запись.Период = '20210101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины;
	Запись.Значение = "18210102080011000110"; 
	
	// 2022 год
	Запись = Набор.Добавить();
	Запись.Период = '20220701';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ЕдиныйНалоговыйПлатеж;
	Запись.Значение = "18201061201010000510";  
	
	Запись = Набор.Добавить();
	Запись.Период = '20220101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "18210214010061005160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20220101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "18210214030081002160";   
	
	Запись = Набор.Добавить();
	Запись.Период = '20220101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	Запись.Значение = "18210214010061001160";  
	
	Запись = Набор.Добавить();
	Запись.Период = '20220101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФОМССотрудники;
	Запись.Значение = "18210214030081001160";      
	
	Запись = Набор.Добавить();
	Запись.Период = '20220101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФСССотрудники;
	Запись.Значение = "18210214020061001160"; 
	
	// 2023 год
	Запись = Набор.Добавить();
	Запись.Период = '20230101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.СтраховыеВзносыЕдиныйТариф;
	Запись.Значение = "18210201000011000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20230101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф;
	Запись.Значение = "18210202000011000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20230101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.АвансовыйПлатежПриУСН;
	Запись.Значение = "18210501011011000110";
	
	Запись = Набор.Добавить();
	Запись.Период = '20230101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ЕдиныйНалогПриУСН;
	Запись.Значение = "18210501011011000110";
	
	Запись = Набор.Добавить();
	Запись.Период = '20230101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.АвансовыйПлатежПриУСНРасходы;
	Запись.Значение = "18210501021011000110";
	
	Запись = Набор.Добавить();
	Запись.Период = '20230101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ЕдиныйНалогПриУСНРасходы;
	Запись.Значение = "18210501021011000110";
	
	Запись = Набор.Добавить();
	Запись.Период = '20230101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.Патент;
	Запись.Значение = "18210504010021000110";
	
	Запись = Набор.Добавить();
	Запись.Период = '20230101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФССТравматизмСотрудники;
	Запись.Значение = "79710212000061000160";  
	
	Запись = Набор.Добавить();
	Запись.Период = '20230101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСвыше300ТР;
	Запись.Значение = "18210203000011000160"; 
	
	// 2025 год
	Запись = Набор.Добавить();
	Запись.Период = '20250101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины18;
	Запись.Значение = "18210102150011000110";     
	
	Запись = Набор.Добавить();
	Запись.Период = '20250101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины20;
	Запись.Значение = "18210102160011000110"; 

	Запись = Набор.Добавить();
	Запись.Период = '20250101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины22;
	Запись.Значение = "18210102170011000110"; 

	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
